mshakeri63/IoT-Libraries/S32k144/IMU/asm330lhh_reg.h
#define ASM330LHH_CTRL2_G                      0x11U
typedef struct {
  uint8_t fs_g                     : 4; /* fs_4000 + fs_125 + fs_g */
  uint8_t odr_g                    : 4;
} asm330lhh_ctrl2_g_t;

#define ASM330LHH_CTRL3_C                      0x12U
typedef struct {
  uint8_t sw_reset                 : 1;
  uint8_t not_used_01              : 1;
  uint8_t if_inc                   : 1;
  uint8_t sim                      : 1;
  uint8_t pp_od                    : 1;
  uint8_t h_lactive                : 1;
  uint8_t bdu                      : 1;
  uint8_t boot                     : 1;
} asm330lhh_ctrl3_c_t;

#define ASM330LHH_CTRL4_C                      0x13U
typedef struct {
  uint8_t not_used_01              : 1;
  uint8_t lpf1_sel_g               : 1;
  uint8_t i2c_disable              : 1;
  uint8_t drdy_mask                : 1;
  uint8_t not_used_02              : 1;
  uint8_t int2_on_int1             : 1;
  uint8_t sleep_g                  : 1;
  uint8_t not_used_03              : 1;
} asm330lhh_ctrl4_c_t;

#define ASM330LHH_CTRL5_C                      0x14U
typedef struct {
  uint8_t st_xl                    : 2;
  uint8_t st_g                     : 2;
  uint8_t not_used_01              : 1;
  uint8_t rounding                 : 2;
  uint8_t not_used_02              : 1;
} asm330lhh_ctrl5_c_t;

#define ASM330LHH_CTRL6_G                      0x15U
typedef struct {
  uint8_t ftype                    : 3;
  uint8_t usr_off_w                : 1;
  uint8_t not_used_01              : 1;
  uint8_t den_mode                 : 3;   /* trig_en + lvl1_en + lvl2_en */
} asm330lhh_ctrl6_g_t;

#define ASM330LHH_CTRL7_G                      0x16U
typedef struct {
  uint8_t not_used_01              : 1;
  uint8_t usr_off_on_out           : 1;
  uint8_t not_used_02              : 2;
  uint8_t hpm_g                    : 2;
  uint8_t hp_en_g                  : 1;
  uint8_t not_used_03              : 1;
} asm330lhh_ctrl7_g_t;

#define ASM330LHH_CTRL8_XL                     0x17U
typedef struct {
  uint8_t low_pass_on_6d           : 1;
  uint8_t not_used_01              : 1;
  uint8_t hp_slope_xl_en           : 1;
  uint8_t fastsettl_mode_xl        : 1;
  uint8_t hp_ref_mode_xl           : 1;
  uint8_t hpcf_xl                  : 3;
} asm330lhh_ctrl8_xl_t;

#define ASM330LHH_CTRL9_XL                     0x18U
typedef struct {
  uint8_t not_used_01              : 1;
  uint8_t device_conf              : 1;
  uint8_t den_lh                   : 1;
  uint8_t den_xl_g                 : 2;   /* den_xl_en + den_xl_g */
  uint8_t den_z                    : 1;
  uint8_t den_y                    : 1;
  uint8_t den_x                    : 1;
} asm330lhh_ctrl9_xl_t;

#define ASM330LHH_CTRL10_C                     0x19U
typedef struct {
  uint8_t not_used_01              : 5;
  uint8_t timestamp_en             : 1;
  uint8_t not_used_02              : 2;
} asm330lhh_ctrl10_c_t;

#define ASM330LHH_ALL_INT_SRC                  0x1AU
typedef struct {
  uint8_t ff_ia                    : 1;
  uint8_t wu_ia                    : 1;
  uint8_t not_used_01              : 2;
  uint8_t d6d_ia                   : 1;
  uint8_t sleep_change             : 1;
  uint8_t not_used_02              : 1;
  uint8_t timestamp_endcount       : 1;
} asm330lhh_all_int_src_t;

#define ASM330LHH_WAKE_UP_SRC                  0x1BU
typedef struct {
  uint8_t z_wu                     : 1;
  uint8_t y_wu                     : 1;
  uint8_t x_wu                     : 1;
  uint8_t wu_ia                    : 1;
  uint8_t sleep_change             : 1;
  uint8_t ff_ia                    : 1;
  uint8_t not_used_01              : 2;
} asm330lhh_wake_up_src_t;

#define ASM330LHH_TAP_SRC                      0x1CU
typedef struct {
  uint8_t z_tap                    : 1;
  uint8_t y_tap                    : 1;
  uint8_t x_tap                    : 1;
  uint8_t tap_sign                 : 1;
  uint8_t double_tap               : 1;
  uint8_t single_tap               : 1;
  uint8_t tap_ia                   : 1;
  uint8_t not_used_01              : 1;
} asm330lhh_tap_src_t;

#define ASM330LHH_D6D_SRC                      0x1DU
typedef struct {
  uint8_t xl                       : 1;
  uint8_t xh                       : 1;
  uint8_t yl                       : 1;
  uint8_t yh                       : 1;
  uint8_t zl                       : 1;
  uint8_t zh                       : 1;
  uint8_t d6d_ia                   : 1;
  uint8_t den_drdy                 : 1;
} asm330lhh_d6d_src_t;

#define ASM330LHH_STATUS_REG                   0x1EU
typedef struct {
  uint8_t xlda                     : 1;
  uint8_t gda                      : 1;
  uint8_t tda                      : 1;
  uint8_t not_used_01              : 5;
} asm330lhh_status_reg_t;

#define ASM330LHH_OUT_TEMP_L                   0x20U
#define ASM330LHH_OUT_TEMP_H                   0x21U
#define ASM330LHH_OUTX_L_G                     0x22U
#define ASM330LHH_OUTX_H_G                     0x23U
#define ASM330LHH_OUTY_L_G                     0x24U
#define ASM330LHH_OUTY_H_G                     0x25U
#define ASM330LHH_OUTZ_L_G                     0x26U
#define ASM330LHH_OUTZ_H_G                     0x27U
#define ASM330LHH_OUTX_L_A                     0x28U
#define ASM330LHH_OUTX_H_A                     0x29U
#define ASM330LHH_OUTY_L_A                     0x2AU
#define ASM330LHH_OUTY_H_A                     0x2BU
#define ASM330LHH_OUTZ_L_A                     0x2CU
#define ASM330LHH_OUTZ_H_A                     0x2DU
#define ASM330LHH_FIFO_STATUS1                 0x3AU
typedef struct {
  uint8_t diff_fifo                : 8;
} asm330lhh_fifo_status1_t;

#define ASM330LHH_FIFO_STATUS2                 0x3BU
typedef struct {
  uint8_t diff_fifo                : 2;
  uint8_t not_used_01              : 1;
  uint8_t over_run_latched         : 1;
  uint8_t counter_bdr_ia           : 1;
  uint8_t fifo_full_ia             : 1;
  uint8_t fifo_ovr_ia              : 1;
  uint8_t fifo_wtm_ia              : 1;
} asm330lhh_fifo_status2_t;

#define ASM330LHH_TIMESTAMP0                   0x40U
#define ASM330LHH_TIMESTAMP1                   0x41U
#define ASM330LHH_TIMESTAMP2                   0x42U
#define ASM330LHH_TIMESTAMP3                   0x43U
#define ASM330LHH_INT_CFG0                     0x56U
typedef struct {
  uint8_t lir                      : 1;
  uint8_t not_used_01              : 3;
  uint8_t slope_fds                : 1;
  uint8_t sleep_status_on_int      : 1;
  uint8_t int_clr_on_read          : 1;
  uint8_t not_used_02              : 1;
} asm330lhh_int_cfg0_t;

#define ASM330LHH_INT_CFG1                     0x58U
typedef struct {
  uint8_t not_used_01              : 5;
  uint8_t inact_en                 : 2;
  uint8_t interrupts_enable        : 1;
} asm330lhh_int_cfg1_t;

#define ASM330LHH_THS_6D                       0x59U
typedef struct {
  uint8_t not_used_01              : 5;
  uint8_t sixd_ths                 : 2;
  uint8_t d4d_en                   : 1;
} asm330lhh_ths_6d_t;

#define ASM330LHH_INT_DUR2                     0x5AU
typedef struct {
  uint8_t shock                    : 2;
  uint8_t quiet                    : 2;
  uint8_t dur                      : 4;
} asm330lhh_int_dur2_t;

#define ASM330LHH_WAKE_UP_THS                  0x5BU
typedef struct {
  uint8_t wk_ths                   : 6;
  uint8_t usr_off_on_wu            : 1;
  uint8_t not_used_01              : 1;
} asm330lhh_wake_up_ths_t;

