mshakeri63/IoT-Libraries/S32k144/IMU/asm330lhh_reg.h
typedef enum {
  ASM330LHH_ULTRA_LIGHT  = 0,
  ASM330LHH_VERY_LIGHT   = 1,
  ASM330LHH_LIGHT        = 2,
  ASM330LHH_MEDIUM       = 3,
  ASM330LHH_STRONG       = 4,
  ASM330LHH_VERY_STRONG  = 5,
  ASM330LHH_AGGRESSIVE   = 6,
  ASM330LHH_XTREME       = 7,
} asm330lhh_ftype_t;
int32_t asm330lhh_gy_lp1_bandwidth_set(asm330lhh_ctx_t *ctx, asm330lhh_ftype_t val);
int32_t asm330lhh_gy_lp1_bandwidth_get(asm330lhh_ctx_t *ctx, asm330lhh_ftype_t *val);

int32_t asm330lhh_xl_lp2_on_6d_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_xl_lp2_on_6d_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_HP_PATH_DISABLE_ON_OUT    = 0x00,
  ASM330LHH_SLOPE_ODR_DIV_4           = 0x10,
  ASM330LHH_HP_ODR_DIV_10             = 0x11,
  ASM330LHH_HP_ODR_DIV_20             = 0x12,
  ASM330LHH_HP_ODR_DIV_45             = 0x13,
  ASM330LHH_HP_ODR_DIV_100            = 0x14,
  ASM330LHH_HP_ODR_DIV_200            = 0x15,
  ASM330LHH_HP_ODR_DIV_400            = 0x16,
  ASM330LHH_HP_ODR_DIV_800            = 0x17,
  ASM330LHH_HP_REF_MD_ODR_DIV_10      = 0x31,
  ASM330LHH_HP_REF_MD_ODR_DIV_20      = 0x32,
  ASM330LHH_HP_REF_MD_ODR_DIV_45      = 0x33,
  ASM330LHH_HP_REF_MD_ODR_DIV_100     = 0x34,
  ASM330LHH_HP_REF_MD_ODR_DIV_200     = 0x35,
  ASM330LHH_HP_REF_MD_ODR_DIV_400     = 0x36,
  ASM330LHH_HP_REF_MD_ODR_DIV_800     = 0x37,
  ASM330LHH_LP_ODR_DIV_10             = 0x01,
  ASM330LHH_LP_ODR_DIV_20             = 0x02,
  ASM330LHH_LP_ODR_DIV_45             = 0x03,
  ASM330LHH_LP_ODR_DIV_100            = 0x04,
  ASM330LHH_LP_ODR_DIV_200            = 0x05,
  ASM330LHH_LP_ODR_DIV_400            = 0x06,
  ASM330LHH_LP_ODR_DIV_800            = 0x07,
} asm330lhh_hp_slope_xl_en_t;
int32_t asm330lhh_xl_hp_path_on_out_set(asm330lhh_ctx_t *ctx,
                                      asm330lhh_hp_slope_xl_en_t val);
int32_t asm330lhh_xl_hp_path_on_out_get(asm330lhh_ctx_t *ctx,
                                      asm330lhh_hp_slope_xl_en_t *val);

int32_t asm330lhh_xl_fast_settling_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_xl_fast_settling_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_USE_SLOPE = 0,
  ASM330LHH_USE_HPF   = 1,
} asm330lhh_slope_fds_t;
int32_t asm330lhh_xl_hp_path_internal_set(asm330lhh_ctx_t *ctx,
                                        asm330lhh_slope_fds_t val);
int32_t asm330lhh_xl_hp_path_internal_get(asm330lhh_ctx_t *ctx,
                                        asm330lhh_slope_fds_t *val);

typedef enum {
  ASM330LHH_HP_FILTER_NONE     = 0x00,
  ASM330LHH_HP_FILTER_16mHz    = 0x80,
  ASM330LHH_HP_FILTER_65mHz    = 0x81,
  ASM330LHH_HP_FILTER_260mHz   = 0x82,
  ASM330LHH_HP_FILTER_1Hz04    = 0x83,
} asm330lhh_hpm_g_t;
int32_t asm330lhh_gy_hp_path_internal_set(asm330lhh_ctx_t *ctx,
                                        asm330lhh_hpm_g_t val);
int32_t asm330lhh_gy_hp_path_internal_get(asm330lhh_ctx_t *ctx,
                                        asm330lhh_hpm_g_t *val);

typedef enum {
  ASM330LHH_PULL_UP_DISC       = 0,
  ASM330LHH_PULL_UP_CONNECT    = 1,
} asm330lhh_sdo_pu_en_t;
int32_t asm330lhh_sdo_sa0_mode_set(asm330lhh_ctx_t *ctx, asm330lhh_sdo_pu_en_t val);
int32_t asm330lhh_sdo_sa0_mode_get(asm330lhh_ctx_t *ctx, asm330lhh_sdo_pu_en_t *val);

typedef enum {
  ASM330LHH_SPI_4_WIRE = 0,
  ASM330LHH_SPI_3_WIRE = 1,
} asm330lhh_sim_t;
int32_t asm330lhh_spi_mode_set(asm330lhh_ctx_t *ctx, asm330lhh_sim_t val);
int32_t asm330lhh_spi_mode_get(asm330lhh_ctx_t *ctx, asm330lhh_sim_t *val);

typedef enum {
  ASM330LHH_I2C_ENABLE  = 0,
  ASM330LHH_I2C_DISABLE = 1,
} asm330lhh_i2c_disable_t;
int32_t asm330lhh_i2c_interface_set(asm330lhh_ctx_t *ctx,
                                  asm330lhh_i2c_disable_t val);
int32_t asm330lhh_i2c_interface_get(asm330lhh_ctx_t *ctx,
                                  asm330lhh_i2c_disable_t *val);

typedef struct {
    asm330lhh_int1_ctrl_t          int1_ctrl;
    asm330lhh_md1_cfg_t            md1_cfg;
} asm330lhh_pin_int1_route_t;
int32_t asm330lhh_pin_int1_route_set(asm330lhh_ctx_t *ctx,
                                   asm330lhh_pin_int1_route_t *val);
int32_t asm330lhh_pin_int1_route_get(asm330lhh_ctx_t *ctx,
                                   asm330lhh_pin_int1_route_t *val);

typedef struct {
  asm330lhh_int2_ctrl_t          int2_ctrl;
  asm330lhh_md2_cfg_t            md2_cfg;
} asm330lhh_pin_int2_route_t;
int32_t asm330lhh_pin_int2_route_set(asm330lhh_ctx_t *ctx,
                                   asm330lhh_pin_int2_route_t *val);
int32_t asm330lhh_pin_int2_route_get(asm330lhh_ctx_t *ctx,
                                   asm330lhh_pin_int2_route_t *val);

typedef enum {
  ASM330LHH_PUSH_PULL   = 0,
  ASM330LHH_OPEN_DRAIN  = 1,
} asm330lhh_pp_od_t;
int32_t asm330lhh_pin_mode_set(asm330lhh_ctx_t *ctx, asm330lhh_pp_od_t val);
int32_t asm330lhh_pin_mode_get(asm330lhh_ctx_t *ctx, asm330lhh_pp_od_t *val);

typedef enum {
  ASM330LHH_ACTIVE_HIGH = 0,
  ASM330LHH_ACTIVE_LOW  = 1,
} asm330lhh_h_lactive_t;
int32_t asm330lhh_pin_polarity_set(asm330lhh_ctx_t *ctx, asm330lhh_h_lactive_t val);
int32_t asm330lhh_pin_polarity_get(asm330lhh_ctx_t *ctx, asm330lhh_h_lactive_t *val);

int32_t asm330lhh_all_on_int1_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_all_on_int1_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_ALL_INT_PULSED            = 0,
  ASM330LHH_ALL_INT_LATCHED           = 3,
} asm330lhh_lir_t;
int32_t asm330lhh_int_notification_set(asm330lhh_ctx_t *ctx, asm330lhh_lir_t val);
int32_t asm330lhh_int_notification_get(asm330lhh_ctx_t *ctx, asm330lhh_lir_t *val);

typedef enum {
  ASM330LHH_LSb_FS_DIV_64       = 0,
  ASM330LHH_LSb_FS_DIV_256      = 1,
} asm330lhh_wake_ths_w_t;
int32_t asm330lhh_wkup_ths_weight_set(asm330lhh_ctx_t *ctx,
                                    asm330lhh_wake_ths_w_t val);
int32_t asm330lhh_wkup_ths_weight_get(asm330lhh_ctx_t *ctx,
                                    asm330lhh_wake_ths_w_t *val);

int32_t asm330lhh_wkup_threshold_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_wkup_threshold_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_xl_usr_offset_on_wkup_set(asm330lhh_ctx_t *ctx,
                                          uint8_t val);
int32_t asm330lhh_xl_usr_offset_on_wkup_get(asm330lhh_ctx_t *ctx,
                                          uint8_t *val);

int32_t asm330lhh_wkup_dur_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_wkup_dur_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_gy_sleep_mode_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_gy_sleep_mode_get(asm330lhh_ctx_t *ctx, uint8_t *val);

