mshakeri63/IoT-Libraries/S32k144/IMU/asm330lhh_reg.h
int32_t asm330lhh_fifo_wtm_flag_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_GYRO_NC_TAG    = 1,
  ASM330LHH_XL_NC_TAG,
  ASM330LHH_TEMPERATURE_TAG,
  ASM330LHH_TIMESTAMP_TAG,
  ASM330LHH_CFG_CHANGE_TAG,
} asm330lhh_fifo_tag_t;
int32_t asm330lhh_fifo_sensor_tag_get(asm330lhh_ctx_t *ctx,
                                    asm330lhh_fifo_tag_t *val);

typedef enum {
  ASM330LHH_DEN_DISABLE    = 0,
  ASM330LHH_LEVEL_FIFO     = 6,
  ASM330LHH_LEVEL_LETCHED  = 3,
  ASM330LHH_LEVEL_TRIGGER  = 2,
  ASM330LHH_EDGE_TRIGGER   = 4,
} asm330lhh_den_mode_t;
int32_t asm330lhh_den_mode_set(asm330lhh_ctx_t *ctx,
                             asm330lhh_den_mode_t val);
int32_t asm330lhh_den_mode_get(asm330lhh_ctx_t *ctx,
                             asm330lhh_den_mode_t *val);

typedef enum {
  ASM330LHH_DEN_ACT_LOW  = 0,
  ASM330LHH_DEN_ACT_HIGH = 1,
} asm330lhh_den_lh_t;
int32_t asm330lhh_den_polarity_set(asm330lhh_ctx_t *ctx,
                                 asm330lhh_den_lh_t val);
int32_t asm330lhh_den_polarity_get(asm330lhh_ctx_t *ctx,
                                 asm330lhh_den_lh_t *val);

typedef enum {
  ASM330LHH_STAMP_IN_GY_DATA     = 0,
  ASM330LHH_STAMP_IN_XL_DATA     = 1,
  ASM330LHH_STAMP_IN_GY_XL_DATA  = 2,
} asm330lhh_den_xl_g_t;
int32_t asm330lhh_den_enable_set(asm330lhh_ctx_t *ctx,
                               asm330lhh_den_xl_g_t val);
int32_t asm330lhh_den_enable_get(asm330lhh_ctx_t *ctx,
                               asm330lhh_den_xl_g_t *val);

int32_t asm330lhh_den_mark_axis_x_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_den_mark_axis_x_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_den_mark_axis_y_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_den_mark_axis_y_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_den_mark_axis_z_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_den_mark_axis_z_get(asm330lhh_ctx_t *ctx, uint8_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* ASM330LHH_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
